{
  "id": "nn_cnn_2d_scs_r3_p30s10l80%_hog_100_3d/k-fold_9e3c-b34c-4227-9a35-908d-8aaa-a48a-e632/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-11-13T19:51:27Z",
  "val_acc_m": 0.7536945790125,
  "val_acc_d": 0.018242767748618653,
  "val_loss_m": 5.2664183676250005,
  "val_loss_d": 1.181418669294851,
  "test_acc_m": 0.7339901477832512,
  "test_acc_d": 0.013033257689973354,
  "test_loss_m": 0.7186930390730463,
  "test_loss_d": 0.07807291541277067,
  "epoch_m": 16.375,
  "epoch_d": 6.41287766919033,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:88:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_seq/metadata.json",
        "dataset_name": "simple_call_seq",
        "source": "simple_call_seq/audio"
      }
    },
    {
      "task": "SplitIntoPartsTask",
      "props": {
        "part_length": 0.03,
        "strides": 0.01,
        "label_min_cover_length": 0.8
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 4000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_2d_scs_r3_p30s10l80%_hog_100_3d",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    53,
                    24,
                    12
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv2d_input"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    53,
                    24,
                    12
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 7,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "new_dim_size": 12
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_seq/metadata.json",
                "dataset_name": "simple_call_seq",
                "source": "simple_call_seq/audio"
              }
            },
            {
              "task": "SplitIntoPartsTask",
              "props": {
                "part_length": 0.03,
                "strides": 0.01,
                "label_min_cover_length": 0.8
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 4000,
                "height": 512,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractHOGHWRecogTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_seq/models/nn_cnn_2d_scs_r3_p30s10l80%_hog_100_3d/9e3ccd44ca45ba0d6ad05760714c7461e4214609/best_val_acc_e021_v0.7635.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_scs_r3"
        ]
      }
    }
  ],
  "val_acc": [
    0.7635468245,
    0.7684729099,
    0.7487684488,
    0.7733989954,
    0.7290640473,
    0.7635468245,
    0.7586206794,
    0.7241379023
  ],
  "val_loss": [
    5.7546472549,
    4.7568302155,
    3.909460783,
    4.152961731,
    7.0469026566,
    6.7167239189,
    5.4645810127,
    4.3292393684
  ],
  "test_acc": [
    0.7339901477832512,
    0.729064039408867,
    0.7118226600985221,
    0.7266009852216748,
    0.7364532019704434,
    0.7315270935960592,
    0.7536945812807881,
    0.7487684729064039
  ],
  "test_loss": [
    0.7955238495497486,
    0.6240054537058152,
    0.7735786554649838,
    0.6589707884734981,
    0.8129167271514758,
    0.776451386423965,
    0.6360505878141599,
    0.672046864000724
  ],
  "epoch": [
    21,
    11,
    6,
    17,
    24,
    24,
    15,
    13
  ]
}