{
  "id": "nn_cnn_1d_scs_r3_p30s10l60%_hog_100/k-fold_16fa-2752-ae28-0022-8e39-3b36-f5af-1170/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-11-13T11:47:37Z",
  "val_acc_m": 0.7700892910375,
  "val_acc_d": 0.01144410801202537,
  "val_loss_m": 3.7270508706500003,
  "val_loss_d": 0.9579574125436403,
  "test_acc_m": 0.7433035714285714,
  "test_acc_d": 0.013691400442034408,
  "test_loss_m": 0.6975716962013598,
  "test_loss_d": 0.08767245384204955,
  "epoch_m": 37.375,
  "epoch_d": 12.916628264151823,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_seq/metadata.json",
        "dataset_name": "simple_call_seq",
        "source": "simple_call_seq/audio"
      }
    },
    {
      "task": "SplitIntoPartsTask",
      "props": {
        "part_length": 0.03,
        "strides": 0.01,
        "label_min_cover_length": 0.6
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 4000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_1d_scs_r3_p30s10l60%_hog_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    53,
                    288
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv1d_input"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    53,
                    288
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 7,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "add_dim": false
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "run",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_seq/metadata.json",
                "dataset_name": "simple_call_seq",
                "source": "simple_call_seq/audio"
              }
            },
            {
              "task": "SplitIntoPartsTask",
              "props": {
                "part_length": 0.03,
                "strides": 0.01,
                "label_min_cover_length": 0.6
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 4000,
                "height": 512,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractHOGHWRecogTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_seq/models/nn_cnn_1d_scs_r3_p30s10l60%_hog_100/16faf380a3d18bce5aeb6d4be93c5dee6b7b69b0/best_val_acc_e051_v0.7714.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_scs_r3"
        ]
      }
    }
  ],
  "val_acc": [
    0.7714285851,
    0.7607142925,
    0.7678571343,
    0.7749999762,
    0.7714285851,
    0.7535714507,
    0.7678571343,
    0.7928571701
  ],
  "val_loss": [
    5.0743041039,
    2.6408567429,
    4.5531697273,
    2.451757431,
    3.5250689983,
    3.8577823639,
    4.5738458633,
    3.1396217346
  ],
  "test_acc": [
    0.7232142857142857,
    0.7464285714285714,
    0.7357142857142858,
    0.7410714285714286,
    0.7392857142857143,
    0.7660714285714286,
    0.7589285714285714,
    0.7357142857142858
  ],
  "test_loss": [
    0.7896085526727372,
    0.6289422042784281,
    0.837906666320142,
    0.5830055037849109,
    0.6700099741732304,
    0.6442735838912605,
    0.7564416858019894,
    0.67038539868818
  ],
  "epoch": [
    51,
    21,
    56,
    24,
    36,
    33,
    48,
    30
  ]
}