{
  "id": "nn_cnn_1d_scs_r3_p30s10l80%_hog_100/k-fold_9e3c-b34c-4227-9a35-908d-8aaa-a48a-e632/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-11-13T10:38:14Z",
  "val_acc_m": 0.776477836075,
  "val_acc_d": 0.01969341950033094,
  "val_loss_m": 4.4352388083875,
  "val_loss_d": 0.8271318574258295,
  "test_acc_m": 0.7481527093596059,
  "test_acc_d": 0.01978125419237564,
  "test_loss_m": 0.6474879933374947,
  "test_loss_d": 0.07465271152217345,
  "epoch_m": 29.75,
  "epoch_d": 12.314335432448523,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:08:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_seq/metadata.json",
        "dataset_name": "simple_call_seq",
        "source": "simple_call_seq/audio"
      }
    },
    {
      "task": "SplitIntoPartsTask",
      "props": {
        "part_length": 0.03,
        "strides": 0.01,
        "label_min_cover_length": 0.8
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 4000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_1d_scs_r3_p30s10l80%_hog_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    53,
                    288
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv1d_input"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    53,
                    288
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 7,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "add_dim": false
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "run",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_seq/metadata.json",
                "dataset_name": "simple_call_seq",
                "source": "simple_call_seq/audio"
              }
            },
            {
              "task": "SplitIntoPartsTask",
              "props": {
                "part_length": 0.03,
                "strides": 0.01,
                "label_min_cover_length": 0.8
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 4000,
                "height": 512,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractHOGHWRecogTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_seq/models/nn_cnn_1d_scs_r3_p30s10l80%_hog_100/9e3ccd44ca45ba0d6ad05760714c7461e4214609/best_val_acc_e035_v0.8128.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_scs_r3"
        ]
      }
    }
  ],
  "val_acc": [
    0.812807858,
    0.7536945939,
    0.7783251405,
    0.7881773114,
    0.7635468245,
    0.7832512259,
    0.7783251405,
    0.7536945939
  ],
  "val_loss": [
    5.5409879684,
    5.0160441399,
    3.7821705341,
    3.4469134808,
    3.6733365059,
    4.6208124161,
    5.4321660995,
    3.9694793224
  ],
  "test_acc": [
    0.7586206896551724,
    0.7512315270935961,
    0.7192118226600985,
    0.7832512315270936,
    0.7536945812807881,
    0.7266009852216748,
    0.7512315270935961,
    0.7413793103448276
  ],
  "test_loss": [
    0.6464080860780911,
    0.672885197039453,
    0.6602521187932204,
    0.5633715131822423,
    0.5999947390962809,
    0.810329232751949,
    0.6165170934852132,
    0.6101459662735077
  ],
  "epoch": [
    35,
    42,
    18,
    29,
    20,
    52,
    20,
    22
  ]
}