{
  "id": "nn_cnn_1d_scs_r3_p30s5l80%_hog_100/k-fold_412a-e619-6603-0dd2-d720-2141-a532-4c3c/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-11-17T13:06:48Z",
  "val_acc_m": 0.807957388475,
  "val_acc_d": 0.016458551620362687,
  "val_loss_m": 3.5835005641,
  "val_loss_d": 0.6703920726633215,
  "test_acc_m": 0.793859649122807,
  "test_acc_d": 0.011659620113092574,
  "test_loss_m": 0.5659703941818198,
  "test_loss_d": 0.05585031620520274,
  "epoch_m": 32.25,
  "epoch_d": 10.700467279516348,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0, device: 1, name: Tesla P100-PCIE-12GB, pci bus id: 0000:87:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_seq/metadata.json",
        "dataset_name": "simple_call_seq",
        "source": "simple_call_seq/audio"
      }
    },
    {
      "task": "SplitIntoPartsTask",
      "props": {
        "part_length": 0.03,
        "strides": 0.005,
        "label_min_cover_length": 0.8
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 4000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_1d_scs_r3_p30s5l80%_hog_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    53,
                    288
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv1d_input"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    53,
                    288
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 7,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "add_dim": false
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "run",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_seq/metadata.json",
                "dataset_name": "simple_call_seq",
                "source": "simple_call_seq/audio"
              }
            },
            {
              "task": "SplitIntoPartsTask",
              "props": {
                "part_length": 0.03,
                "strides": 0.005,
                "label_min_cover_length": 0.8
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 4000,
                "height": 512,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractHOGHWRecogTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_seq/models/nn_cnn_1d_scs_r3_p30s5l80%_hog_100/412a2eabd34b4c8023cafffd22e9e2509ee50e64/best_val_acc_e017_v0.802.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_scs_r3"
        ]
      }
    }
  ],
  "val_acc": [
    0.802004993,
    0.8070175648,
    0.8320801854,
    0.8170425892,
    0.7994987369,
    0.8245614171,
    0.802004993,
    0.7794486284
  ],
  "val_loss": [
    3.3971531391,
    3.8692650795,
    2.9241070747,
    3.4074511528,
    5.0924272537,
    3.1625065804,
    3.5621173382,
    3.2529768944
  ],
  "test_acc": [
    0.7857142857142857,
    0.8070175438596491,
    0.8020050125313283,
    0.7982456140350878,
    0.8045112781954887,
    0.7807017543859649,
    0.7756892230576441,
    0.7969924812030075
  ],
  "test_loss": [
    0.5207463157651302,
    0.5484184703833674,
    0.5601751444858315,
    0.5452988990661278,
    0.6588267831268118,
    0.559952193627829,
    0.6391421224263312,
    0.4952032245731296
  ],
  "epoch": [
    17,
    33,
    35,
    36,
    47,
    29,
    43,
    18
  ]
}